Tekla.Structures.Model.ReferenceModelObject
The ReferenceModelObject class contains methods related to reference model objects.
A reference model object is a subobject of a reference model.

Tekla.Structures.Model.ReferenceModelObject._ReferenceModelId
The identifier of the reference model that the object belongs to.

Tekla.Structures.Model.ReferenceModelObject._ReferenceHierarchyFather
The identifier of the reference hierarchy father part.

Tekla.Structures.Model.ReferenceModelObject.#ctor(System.Int32,Tekla.Structures.Identifier)
Creates a new reference model object instance using the given parameters.
ReferenceModelId: The identifier of the reference model.
ID: The identifier for the new reference model object.

Tekla.Structures.Model.ReferenceModelObject.#ctor
Creates a new reference model object instance.

Tekla.Structures.Model.ReferenceModelObject.GetReferenceModel
Gets the reference model that the reference object belongs to.
Returns: The reference model on success, null otherwise.

Tekla.Structures.Model.ReferenceModelObject.Insert
At the moment reference objects cannot be inserted.
Returns: An exception.

Tekla.Structures.Model.ReferenceModelObject.Select
Selects the reference model with the given identifier.
Returns: True on success.

Tekla.Structures.Model.ReferenceModelObject.Modify
At the moment reference objects cannot be modified.
Returns: An exception.

Tekla.Structures.Model.ReferenceModelObject.Delete
At the moment reference objects cannot be deleted.
Returns: An exception.

Tekla.Structures.Model.ReferenceModelObject.GetFather
Returns the reference hierarchy father.
Returns: Reference to the graph father if such exists, or else an invalid object.

Tekla.Structures.Model.ReferenceModelObject.SelectInstance
Selects the reference object instance from the model.
Returns: True if the selection succeeds, false otherwise